duxinglang-1/nRF9160_test/E2_V3_NEW_UI_TEST/src/screen/screen.c
			x = TEMP_STR_X+(TEMP_STR_W-count*TEMP_NUM_W-TEMP_DOT_W)/2;
			y = TEMP_STR_Y;
		
			if(count == 1)
			{
				x = TEMP_STR_X+(TEMP_STR_W-2*TEMP_NUM_W-TEMP_DOT_W)/2;
				LCD_ShowImg_From_Flash(x, y, img_num[temp_body/10]);
				x += TEMP_NUM_W;
				LCD_ShowImg_From_Flash(x, y, IMG_FONT_42_DOT_ADDR);
				x += TEMP_DOT_W;
				LCD_ShowImg_From_Flash(x, y, img_num[temp_body%10]);
				x += TEMP_NUM_W;
			}
			else
			{
				for(i=0;i<(count+1);i++)
				{
					if(i == count-1)
					{
						LCD_ShowImg_From_Flash(x, y, IMG_FONT_42_DOT_ADDR);
						x += TEMP_DOT_W;
					}
					else
					{
						LCD_ShowImg_From_Flash(x, y, img_num[temp_body/divisor]);
						temp_body = temp_body%divisor;
						divisor = divisor/10;
						x += TEMP_NUM_W;
					}
				}
			}
			
			if(global_settings.temp_unit == TEMP_UINT_C)
				LCD_ShowImg_From_Flash(x, TEMP_UNIT_Y, IMG_TEMP_UNIT_C_ADDR);
			else
				LCD_ShowImg_From_Flash(x, TEMP_UNIT_Y, IMG_TEMP_UNIT_F_ADDR);
		
			MenuStopTemp();
			k_timer_start(&temp_status_timer, K_SECONDS(5), K_NO_WAIT);
		}
		break;
		
	case TEMP_STATUS_MEASURE_OK:
		LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_3_ADDR);
		k_timer_start(&temp_status_timer, K_SECONDS(2), K_NO_WAIT);
		break;
		
	case TEMP_STATUS_MEASURE_FAIL:
		MenuStopTemp();

		LCD_Fill(TEMP_NOTIFY_X, TEMP_NOTIFY_Y, TEMP_NOTIFY_W, TEMP_NOTIFY_H, BLACK);
		LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_3_ADDR);
		
	#ifdef FONTMAKER_UNICODE_FONT
		LCD_SetFontSize(FONT_SIZE_28);
	#else	
		LCD_SetFontSize(FONT_SIZE_24);
	#endif

		temp_retry_left--;
		if(temp_retry_left == 0)
			mmi_ucs2cpy(tmpbuf, Incon_1_str[global_settings.language]);
		else
			mmi_ucs2cpy(tmpbuf, Incon_2_str[global_settings.language]);
		LCD_MeasureUniString(tmpbuf,&w,&h);
		x = (w > TEMP_NOTIFY_W) ? TEMP_NOTIFY_X : TEMP_NOTIFY_X+(TEMP_NOTIFY_W-w)/2;
		y = TEMP_NOTIFY_Y;
		LCD_ShowUniString(x, y, tmpbuf);		

		k_timer_start(&temp_status_timer, K_SECONDS(5), K_NO_WAIT);
		break;
		
	case TEMP_STATUS_NOTIFY:
		LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_3_ADDR);

	#ifdef FONTMAKER_UNICODE_FONT
		LCD_SetFontSize(FONT_SIZE_28);
	#else	
		LCD_SetFontSize(FONT_SIZE_24);
	#endif

		LCD_MeasureUniString(still_retry_str[global_settings.language],&w,&h);
		x = (w > TEMP_NOTIFY_W) ? TEMP_NOTIFY_X : TEMP_NOTIFY_X+(TEMP_NOTIFY_W-w)/2;
		y = TEMP_NOTIFY_Y;
		LCD_ShowUniString(x, y, still_retry_str[global_settings.language]);

		k_timer_start(&temp_status_timer, K_SECONDS(5), K_NO_WAIT);
		break;
	}
#endif/*UI_STYLE_HEALTH_BAR*/
}

void TempShowStatus(void)
{
	uint16_t x,y,w,h;
	uint8_t i,tmpbuf[64] = {0};
	float temp_max = 0.0, temp_min = 0.0;
	uint16_t temp[24] = {0};
	uint16_t color = 0x05DF;
	uint16_t title_str[LANGUAGE_MAX][19] = {
												{0x0042,0x006F,0x0064,0x0079,0x0020,0x0054,0x0065,0x006D,0x0070,0x0065,0x0072,0x0061,0x0074,0x0075,0x0072,0x0065,0x0000},//Body Temperature
												{0x004B,0x00F6,0x0072,0x0070,0x0065,0x0072,0x0074,0x0065,0x006D,0x0070,0x0065,0x0072,0x0061,0x0074,0x0075,0x0072,0x0000},//K?rpertemperatur
												{0x4F53,0x6E29,0x0000},//体温
											};

#ifdef UI_STYLE_HEALTH_BAR
	if(global_settings.temp_unit == TEMP_UINT_C)
	{		
		LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_ICON_C_ADDR);
		LCD_ShowImg_From_Flash(TEMP_BG_X, TEMP_BG_Y, IMG_TEMP_C_BG_ADDR);
		LCD_ShowImg_From_Flash(TEMP_UINT_X, TEMP_UINT_Y, IMG_TEMP_UNIT_C_ADDR);
	}
	else
	{
		LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_ICON_F_ADDR);
		LCD_ShowImg_From_Flash(TEMP_BG_X, TEMP_BG_Y, IMG_TEMP_F_BG_ADDR);
		LCD_ShowImg_From_Flash(TEMP_UINT_X, TEMP_UINT_Y, IMG_TEMP_UNIT_F_ADDR);
	}
	LCD_ShowImg_From_Flash(TEMP_UP_ARRAW_X, TEMP_UP_ARRAW_Y, IMG_TEMP_UP_ARRAW_ADDR);
	LCD_ShowImg_From_Flash(TEMP_DOWN_ARRAW_X, TEMP_DOWN_ARRAW_Y, IMG_TEMP_DOWN_ARRAW_ADDR);

	GetCurDayTempRecData(temp);
	for(i=0;i<24;i++)
	{
		if((temp[i] >= TEMP_MIN) && (temp[i] <= TEMP_MAX))
		{
			if((temp_max == 0.0) && (temp_min == 0.0))
			{
				temp_max = (float)temp[i]/10.0;
				temp_min = (float)temp[i]/10.0;
			}
			else
			{
				if(temp[i]/10.0 > temp_max)
					temp_max = (float)temp[i]/10.0;
				if(temp[i]/10.0 < temp_min)
					temp_min = (float)temp[i]/10.0;
			}

			LCD_Fill(TEMP_REC_DATA_X+TEMP_REC_DATA_OFFSET_X*i, TEMP_REC_DATA_Y-(temp[i]/10.0-32.0)*15/2, TEMP_REC_DATA_W, (temp[i]/10.0-32.0)*15/2, color);
		}
	}

  #ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_36);
  #else		
	LCD_SetFontSize(FONT_SIZE_32);
  #endif

	if(global_settings.temp_unit == TEMP_UINT_C)
		sprintf(tmpbuf, "%0.1f", 0);
	else
		sprintf(tmpbuf, "%0.1f", 0);
	LCD_MeasureString(tmpbuf,&w,&h);
	x = TEMP_NUM_X+(TEMP_NUM_W-w)/2;
	y = TEMP_NUM_Y+(TEMP_NUM_H-h)/2;
	LCD_ShowString(x,y,tmpbuf);

  #ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_28);
  #else		
	LCD_SetFontSize(FONT_SIZE_24);
  #endif

	if(global_settings.temp_unit == TEMP_UINT_C)
		sprintf(tmpbuf, "%0.1f", temp_max);
	else
		sprintf(tmpbuf, "%0.1f", temp_max*1.8+32);
	LCD_MeasureString(tmpbuf,&w,&h);
	x = TEMP_UP_NUM_X+(TEMP_UP_NUM_W-w)/2;
	y = TEMP_UP_NUM_Y+(TEMP_UP_NUM_H-h)/2;
	LCD_ShowString(x,y,tmpbuf);

	if(global_settings.temp_unit == TEMP_UINT_C)
		sprintf(tmpbuf, "%0.1f", temp_min);
	else
		sprintf(tmpbuf, "%0.1f", temp_min*1.8+32);
	LCD_MeasureString(tmpbuf,&w,&h);
	x = TEMP_DOWN_NUM_X+(TEMP_DOWN_NUM_W-w)/2;
	y = TEMP_DOWN_NUM_Y+(TEMP_DOWN_NUM_H-h)/2;
	LCD_ShowString(x,y,tmpbuf);

#else/*UI_STYLE_HEALTH_BAR*/
	uint8_t count=1;
	uint16_t temp_body;
	uint32_t divisor=10;
	uint32_t img_num[10] = {IMG_FONT_24_NUM_0_ADDR,IMG_FONT_24_NUM_1_ADDR,IMG_FONT_24_NUM_2_ADDR,IMG_FONT_24_NUM_3_ADDR,IMG_FONT_24_NUM_4_ADDR,
							IMG_FONT_24_NUM_5_ADDR,IMG_FONT_24_NUM_6_ADDR,IMG_FONT_24_NUM_7_ADDR,IMG_FONT_24_NUM_8_ADDR,IMG_FONT_24_NUM_9_ADDR};

	LCD_ShowImg_From_Flash(TEMP_ICON_X, TEMP_ICON_Y, IMG_TEMP_BIG_ICON_3_ADDR);
	LCD_ShowImg_From_Flash(TEMP_UP_ARRAW_X, TEMP_UP_ARRAW_Y, IMG_TEMP_UP_ARRAW_ADDR);
	LCD_ShowImg_From_Flash(TEMP_DOWN_ARRAW_X, TEMP_DOWN_ARRAW_Y, IMG_TEMP_DOWN_ARRAW_ADDR);

  #ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_28);
  #else	
	LCD_SetFontSize(FONT_SIZE_24);
  #endif

	LCD_MeasureUniString(title_str[global_settings.language],&w,&h);
	x = (w > TEMP_NOTIFY_W) ? TEMP_NOTIFY_X : TEMP_NOTIFY_X+(TEMP_NOTIFY_W-w)/2;
	y = TEMP_NOTIFY_Y;
	LCD_ShowUniString(x, y, title_str[global_settings.language]);

	GetCurDayTempRecData(temp);
	for(i=0;i<24;i++)
	{
		if((temp[i] >= TEMP_MIN) && (temp[i] <= TEMP_MAX))
		{
			if((temp_max == 0.0) && (temp_min == 0.0))
			{
				temp_max = (float)temp[i]/10.0;
				temp_min = (float)temp[i]/10.0;
			}
			else
			{
				if(temp[i]/10.0 > temp_max)
					temp_max = (float)temp[i]/10.0;
				if(temp[i]/10.0 < temp_min)
					temp_min = (float)temp[i]/10.0;
			}
		}
	}

	if(global_settings.temp_unit == TEMP_UINT_C)
	{
		temp_body = (uint16_t)(temp_max*10);
	}
	else
	{
		temp_body = (uint16_t)((32+1.8*temp_max)*10);
	}

	while(1)
	{
		if(temp_body/divisor > 0)
		{
			count++;
			divisor = divisor*10;
		}
		else
		{
			divisor = divisor/10;
			break;
		}
	}

	x = TEMP_UP_STR_X;
	y = TEMP_UP_STR_Y;
	if(count == 1)
	{
		x = TEMP_UP_STR_X+(TEMP_UP_STR_W-2*TEMP_UP_NUM_W-TEMP_UP_DOT_W)/2;
		LCD_ShowImg_From_Flash(x, y, img_num[temp_body/10]);
		x += TEMP_UP_NUM_W;
		LCD_ShowImg_From_Flash(x, y, IMG_FONT_24_DOT_ADDR);
		x += TEMP_UP_DOT_W;
		LCD_ShowImg_From_Flash(x, y, img_num[temp_body%10]);
	}
	else
	{
		for(i=0;i<(count+1);i++)
		{
			if(i == count-1)
			{
				LCD_ShowImg_From_Flash(x, y, IMG_FONT_24_DOT_ADDR);
				x += TEMP_UP_DOT_W;
			}
			else
			{
				LCD_ShowImg_From_Flash(x, y, img_num[temp_body/divisor]);
				temp_body = temp_body%divisor;
				divisor = divisor/10;
				x += TEMP_UP_NUM_W;
			}
		}
	}
	
	if(global_settings.temp_unit == TEMP_UINT_C)
	{
		temp_body = (uint16_t)(temp_min*10);
	}
	else
	{
		temp_body = (uint16_t)((32+1.8*temp_min)*10);
	}

	count = 1;
	divisor = 10;
	while(1)
	{
		if(temp_body/divisor > 0)
		{
			count++;
			divisor = divisor*10;
		}
		else
		{
			divisor = divisor/10;
			break;
		}
	}

	x = TEMP_DOWN_STR_X;
	y = TEMP_DOWN_STR_Y;
	if(count == 1)
	{
		x = TEMP_DOWN_STR_X+(TEMP_DOWN_STR_W-2*TEMP_DOWN_NUM_W-TEMP_DOWN_DOT_W)/2;
		LCD_ShowImg_From_Flash(x, y, img_num[temp_body/10]);
		x += TEMP_DOWN_NUM_W;
		LCD_ShowImg_From_Flash(x, y, IMG_FONT_24_DOT_ADDR);
		x += TEMP_DOWN_DOT_W;
		LCD_ShowImg_From_Flash(x, y, img_num[temp_body%10]);
	}
	else
	{
		for(i=0;i<(count+1);i++)
		{
			if(i == count-1)
			{
				LCD_ShowImg_From_Flash(x, y, IMG_FONT_24_DOT_ADDR);
				x += TEMP_DOWN_DOT_W;
			}
			else
			{
				LCD_ShowImg_From_Flash(x, y, img_num[temp_body/divisor]);
				temp_body = temp_body%divisor;
				divisor = divisor/10;
				x += TEMP_DOWN_NUM_W;
			}
		}
	}

